export const HADITH_SECTIONS_FALLBACK: { [bookId: string]: { [sectionId: string]: string } } = {
  "bukhari": {
    "1": "بدء الوحي", "2": "الإيمان", "3": "العلم", "4": "الوضوء", "5": "الغسل", "6": "الحيض", "7": "التيمم", "8": "الصلاة", "9": "مواقيت الصلاة", "10": "الأذان",
    "11": "الجمعة", "12": "صلاة الخوف", "13": "العيدين", "14": "الوتر", "15": "الاستسقاء", "16": "الكسوف", "17": "سجود القرآن", "18": "تقصير الصلاة", "19": "التهجد", "20": "الجنائز",
    "21": "الزكاة", "22": "الحج", "23": "العمرة", "24": "المحصر", "25": "جزاء الصيد", "26": "فضائل المدينة", "27": "الصوم", "28": "صلاة التراويح", "29": "فضل ليلة القدر", "30": "الاعتكاف",
    "31": "البيوع", "32": "السلم", "33": "الشفعة", "34": "الإجارة", "35": "الحوالات", "36": "الكفالة", "37": "الوكالة", "38": "المزارعة", "39": "المساقاة", "40": "الاستقراض",
    "41": "الخصومات", "42": "اللقطة", "43": "المظالم", "44": "الشركة", "45": "الرهن", "46": "العتق", "47": "المكاتب", "48": "الهبة", "49": "الشهادات", "50": "الصلح",
    "51": "الشروط", "52": "الوصايا", "53": "الجهاد والسير", "54": "الخمس", "55": "الجزية", "56": "بدء الخلق", "57": "أحاديث الأنبياء", "58": "المناقب", "59": "فضائل الصحابة", "60": "مناقب الأنصار",
    "61": "المغازي", "62": "التفسير", "63": "فضائل القرآن", "64": "النكاح", "65": "الطلاق", "66": "النفقات", "67": "الأطعمة", "68": "العقيقة", "69": "الذبائح والصيد", "70": "الأضاحي",
    "71": "الأشربة", "72": "المرضى", "73": "الطب", "74": "اللباس", "75": "الأدب", "76": "الاستئذان", "77": "الدعوات", "78": "الرقاق", "79": "القدر", "80": "الأيمان والنذور",
    "81": "كفارات الأيمان", "82": "الفرائض", "83": "الحدود", "84": "المحاربين", "85": "الديات", "86": "استتابة المرتدين", "87": "الإكراه", "88": "الحيل", "89": "التعبير", "90": "الفتن",
    "91": "الأحكام", "92": "التمني", "93": "خبر الواحد", "94": "الاعتصام", "95": "التوحيد"
  },
  "muslim": {
    "1": "الإيمان", "2": "الطهارة", "3": "الحيض", "4": "الصلاة", "5": "المساجد", "6": "صلاة المسافرين", "7": "الجمعة", "8": "صلاة العيدين", "9": "صلاة الاستسقاء", "10": "الكسوف",
    "11": "الجنائز", "12": "الزكاة", "13": "الصيام", "14": "الاعتكاف", "15": "الحج", "16": "النكاح", "17": "الرضاع", "18": "الطلاق", "19": "اللعان", "20": "العتق",
    "21": "البيوع", "22": "المساقاة", "23": "الفرائض", "24": "الهبات", "25": "الوصية", "26": "النذر", "27": "الأيمان", "28": "القسامة والمحاربين", "29": "الحدود", "30": "الأقضية",
    "31": "اللقطة", "32": "الجهاد والسير", "33": "الإمارة", "34": "الصيد والذبائح", "35": "الأضاحي", "36": "الأشربة", "37": "اللباس والزينة", "38": "الأدب", "39": "السلام", "40": "الألفاظ من الأدب",
    "41": "الشعر", "42": "الرؤيا", "43": "الفضائل", "44": "فضائل الصحابة", "45": "البر والصلة", "46": "القدر", "47": "العلم", "48": "الذكر والدعاء", "49": "الرقاق", "50": "التوبة",
    "51": "صفات المنافقين", "52": "صفة القيامة", "53": "الجنة وصفة نعيمها", "54": "الفتن وأشراط الساعة", "55": "الزهد", "56": "التفسير"
  },
  "abudawud": {
    "1": "الطهارة", "2": "الصلاة", "3": "الزكاة", "4": "اللقطة", "5": "المناسك", "6": "النكاح", "7": "الطلاق", "8": "الصوم", "9": "الجهاد", "10": "الأضحية",
    "11": "الصيد", "12": "الوصايا", "13": "الفرائض", "14": "البيوع", "15": "الإجارة", "16": "الرهن", "17": "الأقضية", "18": "العلم", "19": "الأشربة", "20": "الأطعمة",
    "21": "الطب", "22": "الكهانة والعرافة", "23": "العتق", "24": "الحروف والقراءات", "25": "الحمام", "26": "الستر", "27": "الترجل", "28": "الخاتم", "29": "الفتن والملاحم", "30": "المهدي",
    "31": "الملاحم", "32": "الحدود", "33": "الديات", "34": "السنة", "35": "الأدب"
  },
  "tirmidhi": {
    "1": "الطهارة", "2": "الصلاة", "3": "الزكاة", "4": "الصوم", "5": "الحج", "6": "الجنائز", "7": "النكاح", "8": "الرضاع", "9": "الطلاق والنفقات", "10": "البيوع",
    "11": "الأحكام", "12": "الديات", "13": "الحدود", "14": "الصيد", "15": "الأضاحي", "16": "النذور والأيمان", "17": "السير", "18": "فضائل الجهاد", "19": "الجهاد", "20": "اللِباس",
    "21": "الأطعمة", "22": "الأشربة", "23": "البر والصلة", "24": "الطب", "25": "الفرائض", "26": "الوصايا", "27": "الولاء والهبة", "28": "القدر", "29": "الفتن", "30": "الرؤيا",
    "31": "الشهادات", "32": "الزهد", "33": "صفة القيامة", "34": "صفة الجنة", "35": "صفة جهنم", "36": "الإيمان", "37": "العلم", "38": "الاستئذان والآداب", "39": "الأمثال", "40": "فضائل القرآن",
    "41": "القراءات", "42": "التفسير", "43": "الدعوات", "44": "المناقب"
  },
  "nasai": {
    "1": "الطهارة", "2": "المياه", "3": "الحيض والاستحاضة", "4": "الغسل والتيمم", "5": "الصلاة", "6": "المواقيت", "7": "الأذان", "8": "المساجد", "9": "القبلة", "10": "الإمامة",
    "11": "الافتتاح", "12": "التطبيق", "13": "السهو", "14": "الجمعة", "15": "تقصير الصلاة في السفر", "16": "الكسوف", "17": "الاستسقاء", "18": "صلاة الخوف", "19": "صلاة العيدين", "20": "قيام الليل",
    "21": "الجنائز", "22": "الصيام", "23": "الزكاة", "24": "مناسك الحج", "25": "الجهاد", "26": "النكاح", "27": "الطلاق", "28": "الخيل", "29": "الأحباس", "30": "الوصايا",
    "31": "النحل", "32": "الهبة", "33": "الرقبى", "34": "العمرة", "35": "الأيمان والنذور", "36": "المزارعة", "37": "عشرة النساء", "38": "تحريم الدم", "39": "قسم الفيء", "40": "البيوع",
    "41": "القسامة", "42": "قطع السارق", "43": "الأشربة", "44": "الضحايا", "45": "البيطار", "46": "الصيد والذبائح", "47": "الأيمان والنذور", "48": "الزينة", "49": "آداب القضاة", "50": "الاستعاذة"
  },
  "ibnmajah": {
    "1": "المقدمة", "2": "الطهارة وسننها", "3": "الصلاة", "4": "الأذان والسنن فيها", "5": "الإقامة والسنن فيها", "6": "الجنائز", "7": "الصيام", "8": "الزكاة", "9": "النكاح", "10": "الطلاق",
    "11": "العتاقة", "12": "البيوع", "13": "الأحكام", "14": "الهبات", "15": "الصدقات", "16": "الرهون", "17": "الوصايا", "18": "الفرائض", "19": "الجهاد", "20": "المناسك",
    "21": "الأضاحي", "22": "الذبائح", "23": "الصيد", "24": "الأطعمة", "25": "الأشربة", "26": "الطب", "27": "اللباس", "28": "الأدب", "29": "الدعاء", "30": "تعبير الرؤيا",
    "31": "الفتن", "32": "الزهد"
  },
  "riyadussaliheen": {
    "1": "كتاب المقدمات - الإخلاص", "2": "باب التوبة", "3": "باب الصبر", "4": "باب الصدق", "5": "باب المراقبة",
    "6": "باب التقوى", "7": "باب اليقين والتوكل", "8": "باب الاستقامة", "9": "باب التفكر في عظيم مخلوقات الله", "10": "باب المسارعة إلى الخيرات",
    "11": "باب المجاهدة", "12": "باب الحث على الازدياد من الخير", "13": "باب بيان كثرة طرق الخير", "14": "باب الاقتصاد في العبادة", "15": "باب المحافظة على الأعمال",
    "16": "باب الأمر بالمحافظة على السنة وآدابها", "17": "باب وجوب الانقياد لحكم الله", "18": "باب النهي عن البدع ومحدثات الأمور", "19": "باب من سن سنة حسنة أو سيئة", "20": "باب الدلالة على خير",
    "21": "باب التعاون على البر والتقوى", "22": "باب النصيحة", "23": "باب الأمر بالمعروف والنهي عن المنكر", "24": "باب تغليظ عقوبة من أمر بمعروف أو نهى عن منكر وخالف قوله فعله", "25": "باب الأمر بأداء الأمانة",
    "26": "باب تحريم الظلم والأمر برد المظالم", "27": "باب تعظيم حرمات المسلمين", "28": "باب ستر عورات المسلمين والنهي عن إشاعتها", "29": "باب قضاء حوائج المسلمين", "30": "باب الشفاعة",
    "31": "باب الإصلاح بين الناس", "32": "باب فضل ضعفة المسلمين والفقراء", "33": "باب ملاطفة اليتيم والبنات وسائر الضعفة", "34": "باب الوصية بالنساء", "35": "باب حق الزوج على المرأة"
  },
  "malik": {
    "1": "كتاب وقوت الصلاة", "2": "كتاب الطهارة", "3": "كتاب الصلاة", "4": "كتاب السهو", "5": "كتاب الجمعة",
    "6": "كتاب الصلاة فى رمضان", "7": "كتاب صلاة الليل", "8": "كتاب صلاة الجماعة", "9": "كتاب قصر الصلاة فى السفر", "10": "كتاب العيدين",
    "11": "كتاب صلاة الخوف", "12": "كتاب صلاة الكسوف", "13": "كتاب الاستسقاء", "14": "كتاب القبلة", "15": "كتاب القرآن",
    "16": "كتاب الجنائز", "17": "كتاب الزكاة", "18": "كتاب الصيام", "19": "كتاب الاعتكاف", "20": "كتاب الحج",
    "21": "كتاب الجهاد", "22": "كتاب النذور والأيمان", "23": "كتاب الضحايا", "24": "كتاب الذبائح", "25": "كتاب الصيد",
    "26": "كتاب العقيقة", "27": "كتاب الفرائض", "28": "كتاب النكاح", "29": "كتاب الطلاق", "30": "كتاب الرضاع"
  },
  "ahmad": {}, // Empty so it forces dynamic fetch of the full 264 parts
  "darimi": {
    "1": "باب كيف كان بدء الوحي", "2": "باب ما كان عليه الناس قبل مبعث النبي ﷺ", "3": "باب في مبعث النبي ﷺ", "4": "باب في حسن النبي ﷺ", "5": "باب في طيب النبي ﷺ",
    "6": "باب في تواضع النبي ﷺ", "7": "باب في آيات النبي ﷺ", "8": "باب في كرامة النبي ﷺ على ربه", "9": "باب في وفاة النبي ﷺ", "10": "باب في اتباع السنة",
    "11": "باب التورع عن الجواب", "12": "باب في كراهية كتابة العلم", "13": "باب في رخصة كتابة العلم", "14": "باب في فضل العلم والعالم", "15": "باب في إعظام العلم"
  }
};
